/*测试Code*/
/*
  (function () {
        window.page = "101006";
        var gas = document.createElement("script");
        gas.type = "text/javascript";
        gas.async = true;
        gas.src = "http://" + window.location.host + "/js/gas.js";

        var l = document.getElementsByTagName("script").length;
        var g = document.getElementsByTagName("script")[l - 1];
        g.parentNode.insertBefore(gas, g);
    })();
*/
(function (w) {
    w = w || this;
    //主对象
    var main = {}, db = {}, map = {}, el = {}, op = {
        page: "",
    };
    //获取页面id
    op.page = window.page;

    var extend = function (o, n) {
        for (var p in n)
            if (n.hasOwnProperty(p) && !o.hasOwnProperty(p))
                o[p] = n[p];
    };
    var isArray = function (obj) {
        return Object.prototype.toString.call(obj) === '[object Array]';
    }
    var arrExtend = function (s, o) {
        if (isArray(s) && isArray(o)) {
            var l = o.length;
            for (var i = 0; i < l; i++) {
                if (o[i]) {
                    s.push(o[i]);
                }
            }
            return o;
        }
        else {
            return [];
        }
    };
    //获取操作对象
    map.get = function (element) {
        var num = element.getAttribute("num");
        if (num) {
            var length = num.length;
            var index = num.indexOf('-');
            var index1 = num.lastIndexOf('-');
            var specialMk = "";
            if (index1) {
                specialMk = num.substring(0, index1);
            }
            num = el.dealSpecialElement(num, element);
            var mk = num.substring(0, index);
            var sort = num.substring(index + 1, length);
            var data = map.mapping[op.page][mk];
            //特别模块处理
            //管理收货地址页-列表
            if (mk == "202043" || mk == "202005") {
                if (sort % 2 == 0) {
                    return data[1];
                }
                else {
                    return data[2];
                }
            }
            else {
                for (var i in data) {
                    var d = data[i];

                    if (d.a == mk) {
                        return d;
                    }
                    if (d.a == specialMk) {
                        return d;
                    }
                    if (d.a == num) {
                        return d;
                    }
                }
            }
        }
        return "";
    };
    //地图 
    //k操作id，v操作名称,a为页面埋点Id
    map.mapping = {
        //注册页
        "101003": {
            "202032": [
                   { "k": "p11001", "v": "注册页-返回", "a": "202032-1" },
                   { "k": "p1002", "v": "注册页-注册点击", "a": "202032-2" },
                   { "k": "p11002", "v": "注册页-其他登录方式-微信", "a": "202032-3" },
                   //特殊
                   { "k": "p1005", "v": "注册页-获取验证码点击", "a": "202032-button-1" },
                   { "k": "p1007", "v": "注册页-同意软件许可及服务点击", "a": "202032-span-2" },
                   { "k": "p11122", "v": "注册页-点击图片验证码", "a": "202032-img-3" },
            ]
        },
        //短信登录页
        "101004": {
            "202034": [
                   { "k": "p11003", "v": "短信登录页-返回", "a": "202034-1" },
                   { "k": "p1003", "v": "短信登录页-短信登录点击", "a": "202034-2" },
                   { "k": "p11004", "v": "短信登录页-其他登录方式-微信", "a": "202034-3" },
                    //特殊
                   { "k": "p1005", "v": "短信登录页-获取验证码点击", "a": "202034-button-1" },
                   { "k": "p1007", "v": "短信登录页-同意软件许可及服务点击", "a": "202034-span-2" },
                   { "k": "p11123", "v": "短信登录页-点击图片验证码", "a": "202034-img-3" },
            ]
        },
        //设置密码页
        "101005": {
            "202035": [
                        { "k": "p11005", "v": "设置密码页-返回", "a": "202035-1" },
                        { "k": "p1009", "v": "设置密码页-保存点击", "a": "202035-2" },
                          //特殊
                        { "k": "p1005", "v": "设置密码页-获取验证码点击", "a": "202035-button-1" },
                        { "k": "p11124", "v": "设置密码页-点击图片验证码", "a": "202035-img-2" },
            ]
        },
        //首页
        "101006": {
            //轮播图
            "202001": [
                    { "k": "p1268", "v": "首页-轮播图滑动", "a": "" },
                    { "k": "p1269", "v": "首页-点击轮播图1", "a": "202001-1" },
                    { "k": "p1270", "v": "首页-点击轮播图2", "a": "202001-2" },
                    { "k": "p1271", "v": "首页-点击轮播图3", "a": "202001-3" },
                    { "k": "p1272", "v": "首页-点击轮播图4", "a": "202001-4" },
                    { "k": "p1273", "v": "首页-点击轮播图5", "a": "202001-5" },
                    { "k": "p1274", "v": "首页-点击轮播图6", "a": "202001-6" },
                    { "k": "p1275", "v": "首页-点击轮播图7", "a": "202001-7" },
                    { "k": "p1276", "v": "首页-点击轮播图8", "a": "202001-8" },
                    { "k": "p1277", "v": "首页-点击轮播图9", "a": "202001-9" },
                    { "k": "p1278", "v": "首页-点击轮播图10", "a": "202001-10" },
                    { "k": "p1279", "v": "首页-点击轮播图11", "a": "202001-11" },
                    { "k": "p1280", "v": "首页-点击轮播图12", "a": "202001-12" },
                    { "k": "p1281", "v": "首页-点击轮播图13", "a": "202001-13" },
                    { "k": "p1282", "v": "首页-点击轮播图14", "a": "202001-14" },
                    { "k": "p1283", "v": "首页-点击轮播图15", "a": "202001-15" },
            ],
            //一栏广告
            "202002": [
           { "k": "p1335", "v": "首页-点击模板六-广告位（一栏广告）", "a": "202002" },
            ],
            //二栏广告
            "202003": [],
            //导航栏
            "202004": [],
            //一栏推荐
            "202005": [
                       { "k": "p1306", "v": "首页-点击模板一更多", "a": "202005-1" },
                       { "k": "p1305", "v": "首页-点击模板一图片（一栏推荐）", "a": "202005-2" },
            ],
            //右两栏推荐
            "202006": [
                           { "k": "p1311", "v": "首页-点击模板三位置1（右两栏推荐 ）", "a": "202006-2" },
                           { "k": "p1312", "v": "首页-点击模板三位置2", "a": "202006-3" },
                           { "k": "p1313", "v": "首页-点击模板三位置3", "a": "202006-4" },
                           { "k": "p1314", "v": "首页-点击模板三更多", "a": "202006-1" },
            ],
            //左两栏推荐
            "202007": [
          { "k": "p1307", "v": "首页-点击模板二位置1（左两栏推荐 ）", "a": "202007-2" },
          { "k": "p1308", "v": "首页-点击模板二位置2", "a": "202007-3" },
          { "k": "p1309", "v": "首页-点击模板二位置3", "a": "202007-4" },
          { "k": "p1310", "v": "首页-点击模板二更多", "a": "202007-1" },
            ],
            //商品推荐
            "202008": [
               { "k": "p1315", "v": "首页-点击模板四位置1（商品推荐）", "a": "202008-2" },
               { "k": "p1316", "v": "首页-点击模板四位置2", "a": "202008-3" },
               { "k": "p1317", "v": "首页-点击模板四位置3", "a": "202008-4" },
               { "k": "p1318", "v": "首页-点击模板四位置4", "a": "202008-5" },
               { "k": "p1319", "v": "首页-点击模板四位置5", "a": "202008-6" },
               { "k": "p1320", "v": "首页-点击模板四位置6", "a": "202008-7" },
               { "k": "p1321", "v": "首页-点击模板四位置7", "a": "202008-8" },
               { "k": "p1322", "v": "首页-点击模板四位置8", "a": "202008-9" },
               { "k": "p1323", "v": "首页-点击模板四位置9", "a": "202008-10" },
               { "k": "p1324", "v": "首页-点击模板四位置10", "a": "202008-11" },
               { "k": "p1325", "v": "首页-点击模板四位置11", "a": "202008-12" },
               { "k": "p1326", "v": "首页-点击模板四位置12", "a": "202008-13" },
               { "k": "p1327", "v": "首页-点击模板四位置13", "a": "202008-14" },
               { "k": "p1328", "v": "首页-点击模板四位置14", "a": "202008-15" },
               { "k": "p1329", "v": "首页-点击模板四位置15", "a": "202008-16" },
               { "k": "p1330", "v": "首页-点击模板四位置16", "a": "202008-17" },
               { "k": "p1331", "v": "首页-点击模板四位置17", "a": "202008-18" },
               { "k": "p1332", "v": "首页-点击模板四位置18", "a": "202008-19" },
               { "k": "p1333", "v": "首页-点击模板四位置19", "a": "202008-20" },
               { "k": "p1334", "v": "首页-点击模板四位置20", "a": "202008-21" },
            ],
            //两栏多行推荐
            "202009": [
            { "k": "p1336", "v": "首页-点击模板五位置1（两栏多行推荐）", "a": "202009-2" },
            { "k": "p1337", "v": "首页-点击模板五位置2", "a": "202009-3" },
            { "k": "p1338", "v": "首页-点击模板五位置3", "a": "202009-4" },
            { "k": "p1339", "v": "首页-点击模板五位置4", "a": "202009-5" },
            { "k": "p1340", "v": "首页-点击模板五位置5", "a": "202009-6" },
            { "k": "p1341", "v": "首页-点击模板五位置6", "a": "202009-7" },
            { "k": "p1342", "v": "首页-点击模板五位置7", "a": "202009-8" },
            { "k": "p1343", "v": "首页-点击模板五位置8", "a": "202009-9" },
            { "k": "p1344", "v": "首页-点击模板五位置9", "a": "202009-10" },
            { "k": "p1345", "v": "首页-点击模板五位置10", "a": "202009-11" },
            { "k": "p1346", "v": "首页-点击模板五位置11", "a": "202009-12" },
            { "k": "p1347", "v": "首页-点击模板五位置12", "a": "202009-13" },
            { "k": "p1348", "v": "首页-点击模板五位置13", "a": "202009-14" },
            { "k": "p1349", "v": "首页-点击模板五位置14", "a": "202009-15" },
            { "k": "p1350", "v": "首页-点击模板五位置15", "a": "202009-16" },
            { "k": "p1351", "v": "首页-点击模板五位置16", "a": "202009-17" },
            { "k": "p1352", "v": "首页-点击模板五位置17", "a": "202009-18" },
            { "k": "p1353", "v": "首页-点击模板五位置18", "a": "202009-19" },
            { "k": "p1354", "v": "首页-点击模板五位置19", "a": "202009-20" },
            { "k": "p1355", "v": "首页-点击模板五位置20", "a": "202009-21" },
            { "k": "p1356", "v": "首页-点击模板五更多", "a": "202009-1" },
            ],
            //TV直播
            "202010": [
              { "k": "p1298", "v": "首页-TV直播商品滑动", "a": "" },
              { "k": "p1299", "v": "首页-点击TV直播商品1商品图片点击", "a": "202010-2" },
              { "k": "p1299", "v": "首页-点击TV直播商品1商品名称点击", "a": "202010-3" },
              { "k": "p1300", "v": "首页-点击TV直播商品2商品图片点击", "a": "202010-4" },
              { "k": "p1300", "v": "首页-点击TV直播商品2商品名称点击", "a": "202010-5" },
              { "k": "p1301", "v": "首页-点击TV直播商品3商品图片点击", "a": "202010-6" },
              { "k": "p1301", "v": "首页-点击TV直播商品3商品名称点击", "a": "202010-7" },
              { "k": "p1302", "v": "首页-点击TV直播商品4商品图片点击", "a": "202010-8" },
              { "k": "p1302", "v": "首页-点击TV直播商品4商品名称点击", "a": "202010-9" },
              { "k": "p1303", "v": "首页-点击TV直播商品5商品图片点击", "a": "202010-10" },
              { "k": "p1303", "v": "首页-点击TV直播商品5商品名称点击", "a": "202010-11" },
              { "k": "p1304", "v": "首页-点击TV直播更多", "a": "202010-1" },
            ],
            //闪购
            "202011": [
            { "k": "p1294", "v": "首页-点击限时抢购位置1", "a": "202011-2" },
            { "k": "p1295", "v": "首页-点击限时抢购位置2", "a": "202011-3" },
            { "k": "p1296", "v": "首页-点击限时抢购位置3", "a": "202011-4" },
            { "k": "p1297", "v": "首页-点击限时抢购更多", "a": "202011-1" },
            ],
            //通知模板
            "202012": [],
            //三栏两行推荐
            "202013": [],
            //两栏两行推荐
            "202014": [],
            //楼层模板
            "202015": [],
            //热门推荐
            "202016": [],
            //猜你喜欢
            "202017": [
                          { "k": "p1679", "v": "首页-点击猜你喜欢位置1", "a": "202017-1" },
                          { "k": "p1680", "v": "首页-点击猜你喜欢位置2", "a": "202017-2" },
                          { "k": "p1681", "v": "首页-点击猜你喜欢位置3", "a": "202017-3" },
                          { "k": "p1682", "v": "首页-点击猜你喜欢位置4", "a": "202017-4" },
                          { "k": "p1683", "v": "首页-点击猜你喜欢位置5", "a": "202017-5" },
                          { "k": "p1684", "v": "首页-点击猜你喜欢位置6", "a": "202017-6" },
                          { "k": "p1685", "v": "首页-点击猜你喜欢位置7", "a": "202017-7" },
                          { "k": "p1686", "v": "首页-点击猜你喜欢位置8", "a": "202017-8" },
                          { "k": "p1687", "v": "首页-点击猜你喜欢位置9", "a": "202017-9" },
                          { "k": "p1688", "v": "首页-点击猜你喜欢位置10", "a": "202017-10" },
                          { "k": "p1689", "v": "首页-点击猜你喜欢位置11", "a": "202017-11" },
                          { "k": "p1690", "v": "首页-点击猜你喜欢位置12", "a": "202017-12" },
                          { "k": "p1691", "v": "首页-点击猜你喜欢位置13", "a": "202017-13" },
                          { "k": "p1692", "v": "首页-点击猜你喜欢位置14", "a": "202017-14" },
                          { "k": "p1693", "v": "首页-点击猜你喜欢位置15", "a": "202017-15" },
                          { "k": "p1694", "v": "首页-点击猜你喜欢位置16", "a": "202017-16" },
                          { "k": "p1695", "v": "首页-点击猜你喜欢位置17", "a": "202017-17" },
                          { "k": "p1696", "v": "首页-点击猜你喜欢位置18", "a": "202017-18" },
                          { "k": "p1697", "v": "首页-点击猜你喜欢位置19", "a": "202017-19" },
                          { "k": "p1698", "v": "首页-点击猜你喜欢位置20", "a": "202017-20" },
                          { "k": "p1699", "v": "首页-点击猜你喜欢位置21（总，除20个位置外商品点击）", "a": "202017-21" },
            ],
            //头部
            "202018": [
                           { "k": "p1027", "v": "目录点击", "a": "202018-1" },
                           { "k": "p1266", "v": "首页-点击搜索", "a": "202018-2" },
                           { "k": "p1015", "v": "导航-我的图标点击", "a": "202018-3" },
            ],
            //功能圈
            "202019": [
                          { "k": "p1286", "v": "首页-功能圈1点击", "a": "202019-1" },
                          { "k": "p1287", "v": "首页-功能圈2点击", "a": "202019-2" },
                          { "k": "p1288", "v": "首页-功能圈3点击", "a": "202019-3" },
                          { "k": "p1289", "v": "首页-功能圈4点击", "a": "202019-4" },
                          { "k": "p1290", "v": "首页-功能圈5点击", "a": "202019-5" },
                          { "k": "p1291", "v": "首页-功能圈6点击", "a": "202019-6" },
                          { "k": "p1292", "v": "首页-功能圈7点击", "a": "202019-7" },
                          { "k": "p1293", "v": "首页-功能圈8点击", "a": "202019-8" },
            ],
            //节日广告位
            "202020": [
                           { "k": "p1284", "v": "首页-节日广告位1点击", "a": "202020-1" },
                           { "k": "p1285", "v": "首页-节日广告位2点击", "a": "202020-2" },
            ],
            //新增
            //固定
            "202101": [
                           { "k": "p11115", "v": "首页-返回头部点击", "a": "202101-1" },
                           { "k": "p1181", "v": "首页-购物车点击", "a": "202101-2" },
                           { "k": "p11116", "v": "首页-copyright点击", "a": "202101-3" },
            ],
            //tip
            "202102": [
                            { "k": "p11117", "v": "首页-app-tip-关闭", "a": "202102-1" },
                            { "k": "p11118", "v": "首页-app-tip-logo", "a": "202102-2" },
                            { "k": "p11119", "v": "首页-app-tip-打开客户端", "a": "202102-3" },

                            { "k": "p11120", "v": "首页-guide-app-tip-打开客户端", "a": "202102-4" },
                            { "k": "p11121", "v": "首页-guide-app-tip-关闭", "a": "202102-5" },
            ]
        },
        //TV直播
        "101009": {
            //头部
            "202027": [
                  { "k": "p11006", "v": "TV直播-返回", "a": "202027-1" },
            ],
            //日期选择
            "202028": [
                   { "k": "p1022", "v": "TV直播-日期选择点击", "a": "202028" },
            ],
            //直播产品列表
            "202029": [
                      //特殊div
                       { "k": "p1024", "v": "TV直播-商品点击", "a": "202029" },
            ]
        },
        //商品列表
        "101010": {
            //头部
            "202024": [
                  { "k": "p11007", "v": "商品列表-返回", "a": "202024-1" },
                  { "k": "p1498", "v": "商品列表页-大图按钮点击", "a": "202024-2" },
                  { "k": "p1499", "v": "商品列表页-列表按钮点击", "a": "202024-2" },
            ],
            //条件筛选
            "202025": [
                        { "k": "p1500", "v": "商品列表页-综合点击", "a": "202025-1" },
                        { "k": "p1501", "v": "商品列表页-销量点击", "a": "202025-2" },
                        { "k": "p1502", "v": "商品列表页-价格正序点击", "a": "202025-a-1" },
                        { "k": "p1503", "v": "商品列表页-价格逆序点击", "a": "202025-a-2" },
                        { "k": "p1504", "v": "商品列表页-人气点击", "a": "202025-4" },
            ],
            //产品列表
            "202026": [
                          { "k": "p1030", "v": "商品列表-商品点击", "a": "202026" },
            ]
        },
        //分类
        "101011": {
            //头部
            "202021": [
                    { "k": "p11008", "v": "分类-点击返回", "a": "202021-1" },
                    { "k": "p11009", "v": "分类-点击搜索", "a": "202021-2" },
            ],
            //一级分类     
            "202022": [
                    { "k": "p1359", "v": "分类-点击一级分类位置1", "a": "202022-1" },
                    { "k": "p1360", "v": "分类-点击一级分类位置2", "a": "202022-2" },
                    { "k": "p1361", "v": "分类-点击一级分类位置3", "a": "202022-3" },
                    { "k": "p1362", "v": "分类-点击一级分类位置4", "a": "202022-4" },
                    { "k": "p1363", "v": "分类-点击一级分类位置5", "a": "202022-5" },
                    { "k": "p1364", "v": "分类-点击一级分类位置6", "a": "202022-6" },
                    { "k": "p1365", "v": "分类-点击一级分类位置7", "a": "202022-7" },
                    { "k": "p1366", "v": "分类-点击一级分类位置8", "a": "202022-8" },
                    { "k": "p1367", "v": "分类-点击一级分类位置9", "a": "202022-9" },
                    { "k": "p1368", "v": "分类-点击一级分类位置10", "a": "202022-10" },
                    { "k": "p1369", "v": "分类-点击一级分类位置11", "a": "202022-11" },
                    { "k": "p1370", "v": "分类-点击一级分类位置12", "a": "202022-12" },
                    { "k": "p1371", "v": "分类-点击一级分类位置13", "a": "202022-13" },
                    { "k": "p1372", "v": "分类-点击一级分类位置14", "a": "202022-14" },
                    { "k": "p1373", "v": "分类-点击一级分类位置15", "a": "202022-15" },
                    { "k": "p1374", "v": "分类-点击一级分类位置16", "a": "202022-16" },
                    { "k": "p1375", "v": "分类-点击一级分类位置17", "a": "202022-17" },
                    { "k": "p1376", "v": "分类-点击一级分类位置18", "a": "202022-18" },
                    { "k": "p1377", "v": "分类-点击一级分类位置19", "a": "202022-19" },
                    { "k": "p1378", "v": "分类-点击一级分类位置20", "a": "202022-20" },
            ],
            //右侧分类
            "202023": [
                     { "k": "p1379", "v": "分类-点击一级分类右侧位置1", "a": "202023-1" },
                     { "k": "p1380", "v": "分类-点击一级分类右侧位置2", "a": "202023-2" },
                     { "k": "p1381", "v": "分类-点击一级分类右侧位置3", "a": "202023-3" },
                     { "k": "p1382", "v": "分类-点击一级分类右侧位置4", "a": "202023-4" },
                     { "k": "p1383", "v": "分类-点击一级分类右侧位置5", "a": "202023-5" },
                     { "k": "p1384", "v": "分类-点击一级分类右侧位置6", "a": "202023-6" },
                     { "k": "p1385", "v": "分类-点击一级分类右侧位置7", "a": "202023-7" },
                     { "k": "p1386", "v": "分类-点击一级分类右侧位置8", "a": "202023-8" },
                     { "k": "p1387", "v": "分类-点击一级分类右侧位置9", "a": "202023-9" },
                     { "k": "p1388", "v": "分类-点击一级分类右侧位置10", "a": "202023-10" },
                     { "k": "p1389", "v": "分类-点击一级分类右侧位置11", "a": "202023-11" },
                     { "k": "p1390", "v": "分类-点击一级分类右侧位置12", "a": "202023-12" },
                     { "k": "p1391", "v": "分类-点击一级分类右侧位置13", "a": "202023-13" },
                     { "k": "p1392", "v": "分类-点击一级分类右侧位置14", "a": "202023-14" },
                     { "k": "p1393", "v": "分类-点击一级分类右侧位置15", "a": "202023-15" },
                     { "k": "p1394", "v": "分类-点击一级分类右侧位置16", "a": "202023-16" },
                     { "k": "p1395", "v": "分类-点击一级分类右侧位置17", "a": "202023-17" },
                     { "k": "p1396", "v": "分类-点击一级分类右侧位置18", "a": "202023-18" },
                     { "k": "p1397", "v": "分类-点击一级分类右侧位置19", "a": "202023-19" },
                     { "k": "p1398", "v": "分类-点击一级分类右侧位置20", "a": "202023-20" },
                     { "k": "p1399", "v": "分类-点击一级分类右侧位置21", "a": "202023-21" },
                     { "k": "p1400", "v": "分类-点击一级分类右侧位置22", "a": "202023-22" },
                     { "k": "p1401", "v": "分类-点击一级分类右侧位置23", "a": "202023-23" },
                     { "k": "p1402", "v": "分类-点击一级分类右侧位置24", "a": "202023-24" },
                     { "k": "p1403", "v": "分类-点击一级分类右侧位置25", "a": "202023-25" },
                     { "k": "p1404", "v": "分类-点击一级分类右侧位置26", "a": "202023-26" },
                     { "k": "p1405", "v": "分类-点击一级分类右侧位置27", "a": "202023-27" },
                     { "k": "p1406", "v": "分类-点击一级分类右侧位置28", "a": "202023-28" },
                     { "k": "p1407", "v": "分类-点击一级分类右侧位置29", "a": "202023-29" },
                     { "k": "p1408", "v": "分类-点击一级分类右侧位置30", "a": "202023-30" },
                     { "k": "p1409", "v": "分类-点击一级分类右侧位置31", "a": "202023-31" },
                     { "k": "p1410", "v": "分类-点击一级分类右侧位置32", "a": "202023-32" },
                     { "k": "p1411", "v": "分类-点击一级分类右侧位置33", "a": "202023-33" },
                     { "k": "p1412", "v": "分类-点击一级分类右侧位置34", "a": "202023-34" },
                     { "k": "p1413", "v": "分类-点击一级分类右侧位置35", "a": "202023-35" },
                     { "k": "p1414", "v": "分类-点击一级分类右侧位置36", "a": "202023-36" },
                     { "k": "p1415", "v": "分类-点击一级分类右侧位置37", "a": "202023-37" },
                     { "k": "p1416", "v": "分类-点击一级分类右侧位置38", "a": "202023-38" },
                     { "k": "p1417", "v": "分类-点击一级分类右侧位置39", "a": "202023-39" },
                     { "k": "p1418", "v": "分类-点击一级分类右侧位置40", "a": "202023-40" },
                     { "k": "p1419", "v": "分类-点击一级分类右侧位置41", "a": "202023-41" },
                     { "k": "p1420", "v": "分类-点击一级分类右侧位置42", "a": "202023-42" },
                     { "k": "p1421", "v": "分类-点击一级分类右侧位置43", "a": "202023-43" },
                     { "k": "p1422", "v": "分类-点击一级分类右侧位置44", "a": "202023-44" },
                     { "k": "p1423", "v": "分类-点击一级分类右侧位置45", "a": "202023-45" },
                     { "k": "p1424", "v": "分类-点击一级分类右侧位置46", "a": "202023-46" },
                     { "k": "p1425", "v": "分类-点击一级分类右侧位置47", "a": "202023-47" },
                     { "k": "p1426", "v": "分类-点击一级分类右侧位置48", "a": "202023-48" },
                     { "k": "p1427", "v": "分类-点击一级分类右侧位置49", "a": "202023-49" },
                     { "k": "p1428", "v": "分类-点击一级分类右侧位置50", "a": "202023-50" },
                     { "k": "p1429", "v": "分类-点击一级分类右侧位置51", "a": "202023-51" },
                     { "k": "p1430", "v": "分类-点击一级分类右侧位置52", "a": "202023-52" },
                     { "k": "p1431", "v": "分类-点击一级分类右侧位置53", "a": "202023-53" },
                     { "k": "p1432", "v": "分类-点击一级分类右侧位置55", "a": "202023-54" },
                     { "k": "p1433", "v": "分类-点击一级分类右侧位置55", "a": "202023-55" },
                     { "k": "p1434", "v": "分类-点击一级分类右侧位置56", "a": "202023-56" },
                     { "k": "p1435", "v": "分类-点击一级分类右侧位置57", "a": "202023-57" },
                     { "k": "p1436", "v": "分类-点击一级分类右侧位置58", "a": "202023-58" },
                     { "k": "p1437", "v": "分类-点击一级分类右侧位置59", "a": "202023-59" },
                     { "k": "p1438", "v": "分类-点击一级分类右侧位置60", "a": "202023-60" },
                     { "k": "p1439", "v": "分类-点击一级分类右侧位置61", "a": "202023-61" },
                     { "k": "p1440", "v": "分类-点击一级分类右侧位置62", "a": "202023-62" },
                     { "k": "p1441", "v": "分类-点击一级分类右侧位置63", "a": "202023-63" },
                     { "k": "p1442", "v": "分类-点击一级分类右侧位置66", "a": "202023-64" },
                     { "k": "p1443", "v": "分类-点击一级分类右侧位置65", "a": "202023-65" },
                     { "k": "p1444", "v": "分类-点击一级分类右侧位置66", "a": "202023-66" },
                     { "k": "p1445", "v": "分类-点击一级分类右侧位置66", "a": "202023-67" },
                     { "k": "p1446", "v": "分类-点击一级分类右侧位置68", "a": "202023-68" },
                     { "k": "p1447", "v": "分类-点击一级分类右侧位置69", "a": "202023-69" },
                     { "k": "p1448", "v": "分类-点击一级分类右侧位置70", "a": "202023-70" },
                     { "k": "p1449", "v": "分类-点击一级分类右侧位置71", "a": "202023-71" },
                     { "k": "p1450", "v": "分类-点击一级分类右侧位置72", "a": "202023-72" },
                     { "k": "p1451", "v": "分类-点击一级分类右侧位置73", "a": "202023-73" },
                     { "k": "p1452", "v": "分类-点击一级分类右侧位置77", "a": "202023-74" },
                     { "k": "p1453", "v": "分类-点击一级分类右侧位置75", "a": "202023-75" },
                     { "k": "p1454", "v": "分类-点击一级分类右侧位置76", "a": "202023-76" },
                     { "k": "p1455", "v": "分类-点击一级分类右侧位置77", "a": "202023-77" },
                     { "k": "p1456", "v": "分类-点击一级分类右侧位置77", "a": "202023-78" },
                     { "k": "p1457", "v": "分类-点击一级分类右侧位置79", "a": "202023-79" },
                     { "k": "p1458", "v": "分类-点击一级分类右侧位置80", "a": "202023-80" },
                     { "k": "p1459", "v": "分类-点击一级分类右侧位置81", "a": "202023-81" },
                     { "k": "p1460", "v": "分类-点击一级分类右侧位置82", "a": "202023-82" },
                     { "k": "p1461", "v": "分类-点击一级分类右侧位置83", "a": "202023-83" },
                     { "k": "p1462", "v": "分类-点击一级分类右侧位置84", "a": "202023-84" },
                     { "k": "p1463", "v": "分类-点击一级分类右侧位置85", "a": "202023-85" },
                     { "k": "p1464", "v": "分类-点击一级分类右侧位置86", "a": "202023-86" },
                     { "k": "p1465", "v": "分类-点击一级分类右侧位置87", "a": "202023-87" },
                     { "k": "p1466", "v": "分类-点击一级分类右侧位置88", "a": "202023-88" },
                     { "k": "p1467", "v": "分类-点击一级分类右侧位置89", "a": "202023-89" },
                     { "k": "p1468", "v": "分类-点击一级分类右侧位置90", "a": "202023-90" },
            ]
        },
        //商品详情页
        "101012": {
            //商品详情页-操作
            "202044": [
                    { "k": "p11010", "v": "商品详情页-返现特权tip-关闭", "a": "202044-1" },
                    { "k": "p11011", "v": "商品详情页-返现特权tip-打开APP", "a": "202044-2" },
                    { "k": "p11012", "v": "商品详情页-返现特权tip-领取返现特权", "a": "202044-3" },
                    { "k": "p11013", "v": "商品详情页-apptip-关闭", "a": "202044-4" },
                    { "k": "p11014", "v": "商品详情页-apptip-logo", "a": "202044-5" },
                    { "k": "p11015", "v": "商品详情页-apptip-打开客户端", "a": "202044-6" },
                    //特殊
                    { "k": "p1505", "v": "商品详情页-收藏点击", "a": "202044-a-1" },
                    { "k": "p1506", "v": "商品详情页-取消收藏点击", "a": "202044-a-2" },

                    { "k": "p1185", "v": "商品详情-购物车按钮点击", "a": "202044-8" },
                    { "k": "p1224", "v": "商品详情页-点击立即购买弹出浮层-点击确定", "a": "202044-9" },
                    { "k": "p1223", "v": "商品详情页-点击购物车弹出浮层-点击确定", "a": "202044-10" },
                    { "k": "p1531", "v": "商品详情页-秒杀立即购买按钮点击", "a": "202044-11" },
                    { "k": "p1039", "v": "商品详情-电话订购弹出框点击取消", "a": "202044-12" },
                    { "k": "p1038", "v": "商品详情-电话订购弹出框点击确认", "a": "202044-13" },
                    //{ "k": "p1532", "v": "商品详情页-立即购买浮层-秒杀立即购买按钮点击", "a": "202044-11" },

                    //特殊
                    { "k": "p1220", "v": "商品详情页-点击查看款式、规格条", "a": "202044-div-1" },
                    { "k": "p1037", "v": "商品详情-电话订购点击", "a": "202044-span-2" },
                    { "k": "p1037", "v": "商品详情-返回", "a": "202044-span-1" },
                    { "k": "p1035", "v": "商品详情页-标签-商品详情点击", "a": "202044-li-1" },
                    { "k": "p1036", "v": "商品详情页-标签-规格参数点击", "a": "202044-li-2" },
                    { "k": "p1588", "v": "商品详情页-标签-常见问题点击", "a": "202044-li-3" },




                    //{ "k": "p1571", "v": "商品详情页-返利帮助按钮点击", "a": "" },

                    //{ "k": "p1186", "v": "商品详情-款式点击（总）", "a": "" },
                    //{ "k": "p1187", "v": "商品详情-规格点击（总）", "a": "" },
                    //{ "k": "p1188", "v": "商品详情-购买数量点击", "a": "" },
                    //{ "k": "p1192", "v": "商品详情-加入购物车点击", "a": "" },
                    //{ "k": "p1193", "v": "商品详情-立即购买点击", "a": "" },
            ],
            //商品详情页-轮播图
            "202045": [
                    { "k": "p1569", "v": "商品详情页-轮播图点击", "a": "202045" },
            ],
            //商品详情页-规格悬浮层
            "202046": [
                  { "k": "p1225", "v": "商品详情页-弹出浮层点击关闭", "a": "202046-1" },
                  { "k": "p1221", "v": "商品详情页-查看款式弹出浮层-点击加入购物车", "a": "202046-2" },
                  { "k": "p1222", "v": "商品详情页-查看款式弹出浮层-点击立即购买", "a": "202046-3" },
                  { "k": "p1533", "v": "商品详情页-查看规格款式浮层-秒杀立即购买按钮点击", "a": "202046-4" },
            ],
            //商品详情页-规格悬浮层-规格选择
            "202047": [
                   { "k": "p1701", "v": "商品详情页-规格款式浮层-区域选择按钮点击", "a": "202047" },
            ],
        },
        //登录
        "101013": {
            //登录页-登录
            "202033": [
                  { "k": "p11016", "v": "登录页-返回", "a": "202033-1" },
                  { "k": "p1002", "v": "登录页-注册点击", "a": "202033-2" },
                  { "k": "p11017", "v": "登录页-手机号-清除", "a": "202033-3" },
                  { "k": "p11018", "v": "登录页-密码-清除", "a": "202033-4" },
                  { "k": "p1001", "v": "登录页-登录点击", "a": "202033-5" },
                  { "k": "p11019", "v": "登录页-其他登录方式-微信", "a": "202033-6" },
                  //特殊
                  { "k": "p11020", "v": "登录页-点击手机快捷登录", "a": "202033-span-1" },
                  { "k": "p11021", "v": "登录页-点击忘记密码", "a": "202033-span-2" },
            ]
        },
        //我的
        "101014": {
            "202036": [
                   { "k": "p11022", "v": "我的-返回按钮", "a": "202036-1" },
                   { "k": "p1050", "v": "我的-登录/注册点击", "a": "202036-2" },
                   { "k": "p1055", "v": "我的-我的订单点击", "a": "202036-3" },
                   { "k": "p1195", "v": "我的-待付款点击", "a": "202036-4" },
                   { "k": "p1196", "v": "我的-待发货点击", "a": "202036-5" },
                   { "k": "p1197", "v": "我的-待收货点击", "a": "202036-6" },
                   { "k": "p1198", "v": "我的-交易成功点击", "a": "202036-7" },
                   { "k": "p1676", "v": "我的-微公社点击", "a": "202036-8" },
                   { "k": "p1481", "v": "我的-点击优惠劵", "a": "202036-9" },
                   { "k": "p1507", "v": "我的-点击我的收藏", "a": "202036-10" },
                   { "k": "p1054", "v": "我的-浏览记录点击", "a": "202036-11" },
                   { "k": "p1581", "v": "我的-意见反馈点击", "a": "202036-12" },
                   { "k": "p1056", "v": "我的-设置退出点击", "a": "202036-13" },
            ]
        },
        //浏览记录
        "101016": {
            //浏览记录页面-操作
            "202039": [
                   { "k": "p11023", "v": "浏览记录页面-返回按钮", "a": "202039-1" },
                   { "k": "p1572", "v": "浏览记录-清空点击", "a": "202039-2" },
                   { "k": "p1526", "v": "浏览记录-点击去逛逛", "a": "202039-3" },
            ],
            //浏览记录页面-产品列表
            "202040": [
                   { "k": "p1074", "v": "浏览记录-商品点击", "a": "202040" },
            ]
        },
        //我的订单列表页
        "101043": {
            //我的订单列表页-操作
            "202069": [
                   { "k": "p1212", "v": "我的订单-返回点击", "a": "202069-1" },
                   //特殊
                   { "k": "p1199", "v": "我的订单-全部点击", "a": "202069-span-1" },

                   { "k": "p1200", "v": "我的订单-待付款点击", "a": "202069-2" },
                   { "k": "p1201", "v": "我的订单-待发货点击", "a": "202069-3" },
                   { "k": "p1202", "v": "我的订单-待收货点击", "a": "202069-4" },
                   { "k": "p1203", "v": "我的订单-交易成功点击", "a": "202069-5" },
                   { "k": "p11024", "v": "我的订单-点击返回头部", "a": "202069-6" },
            ],
            //我的订单列表页-订单列表-操作
            "202070": [
                   //此项比较特殊需要在页面中手动添加或者在js中手动添加
                    { "k": "p1577", "v": "我的订单-删除订单按钮点击", "a": "202070-1" },
                    { "k": "p1767", "v": "我的订单页 - 评价晒单按钮点击", "a": "202070-2" },
                    { "k": "p1204", "v": "我的订单-取消订单点击", "a": "202070-3" },
                    { "k": "p1207", "v": "我的订单-付款点击", "a": "202070-4" },
                    { "k": "p1208", "v": "我的订单-确认收货点击", "a": "202070-5" },
                    { "k": "p1209", "v": "我的订单-电话退款点击", "a": "202070-6" },
                    { "k": "p1210", "v": "我的订单-电话退款/售后点击", "a": "202070-7" },
                    { "k": "p1226", "v": "我的订单-点击查看物流", "a": "202070-8" },
                    { "k": "p1522", "v": "我的订单-订单咨询", "a": "202070-9" },

                    //{ "k": "p1583", "v": "我的订单-删除订单弹出框-取消点击", "a": "" },
                    //{ "k": "p1584", "v": "我的订单-删除订单弹出框-确定点击", "a": "" },
                    //{ "k": "p1205", "v": "我的订单-取消订单弹出框取消点击", "a": "" },
                    //{ "k": "p1206", "v": "我的订单-取消订单弹出框确认点击", "a": "" },
            ],
            //我的订单列表页-订单列表-商品
            "202071": [
                    { "k": "p1211", "v": "我的订单-商品点击", "a": "202071" },
            ]
        },
        //订单详情页
        "101044": {
            //订单详情页-操作
            "202072": [
                  //此项比较特殊需要在页面中手动添加或者在js中手动添加
                   { "k": "p1136", "v": "订单详情页-返回点击", "a": "202072-1" },
                   { "k": "p1134", "v": "订单详情页-付款点击", "a": "202072-2" },
                   { "k": "p1135", "v": "订单详情页-取消订单点击", "a": "202072-3" },
                   { "k": "p1137", "v": "订单详情页-电话退款点击", "a": "202072-4" },
                   { "k": "p1138", "v": "订单详情页-确认收货点击", "a": "202072-5" },
                   { "k": "p1139", "v": "订单详情页-电话退款/售后点击", "a": "202072-6" },
                   { "k": "p1140", "v": "订单详情页-客服电话点击", "a": "202072-7" },
                   { "k": "p1141", "v": "订单详情页-客服电话取消点击", "a": "202072-8" },
                   { "k": "p1227", "v": "订单详情页-点击查看物流按钮", "a": "202072-9" },
                   { "k": "p1228", "v": "订单详情页-点击物流信息", "a": "202072-10" },
                   { "k": "p1537", "v": "订单详情页-点击支付方式", "a": "202072-11" },
                   { "k": "p1585", "v": "订单详情页-删除订单按钮点击", "a": "202072-12" },
                   { "k": "p1768", "v": "订单详情页 - 评价晒单按钮点击", "a": "202072-13" },
                   //{ "k": "p1586", "v": "订单详情页-删除订单弹出框-取消点击", "a": "" },
                   //{ "k": "p1587", "v": "订单详情页-删除订单弹出框-确定点击", "a": "" },
            ],
            //订单详情页-商品列表
            "202073": [
                     { "k": "p1133", "v": "订单详情页-商品详情点击", "a": "202073" },
            ]
        },
        //购物车
        "101045": {
            //购物车页-操作
            "202048": [
                      { "k": "p1154", "v": "购物车页-返回点击", "a": "202048-1" },
                      { "k": "p1144", "v": "购物车页面-编辑页-完成点击", "a": "202048-2" },
                      { "k": "p1152", "v": "购物车页-编辑点击", "a": "202048-3" },
                      { "k": "p1160", "v": "购物车默认页-去逛逛点击", "a": "202048-4" },
                      { "k": "p11025", "v": "购物车默认页-去登录", "a": "202048-5" },
                      { "k": "p1161", "v": "失效商品页-全部清空点击", "a": "202048-6" },
                      { "k": "p1153", "v": "购物车页-结算点击", "a": "202048-7" },
                      { "k": "p1143", "v": "购物车页面-编辑页-删除点击", "a": "202048-8" },
                      { "k": "p1142", "v": "购物车页面-编辑页-全选点击", "a": "202048-lblAllSelEdit-1" },
                      //{ "k": "p1145", "v": "购物车页面-编辑页-返回点击", "a": "" },
                      //{ "k": "p1146", "v": "购物车页面-编辑页-单个勾选点击", "a": "" },
                      //{ "k": "p1147", "v": "购物车页面-编辑页-数量框点击", "a": "" },
                      //{ "k": "p1148", "v": "购物车页面-编辑页-数量框确定点击", "a": "" },
                      //{ "k": "p1149", "v": "购物车页面-编辑页-数量框取消点击", "a": "" },
                      //{ "k": "p1155", "v": "购物车页-单个勾选点击", "a": "" },
                      //{ "k": "p1156", "v": "购物车页-全选点击", "a": "" },
                      //{ "k": "p1159", "v": "购物车页-失效商品点击", "a": "" },
            ],
            //购物车页-商品
            "202049": [
                     { "k": "p1151", "v": "购物车页-商品详情点击", "a": "202049" },
            ]
        },
        //订单确认页
        "101047": {
            //订单确认页-操作
            "202062": [
                        { "k": "p11027", "v": "订单确认页-apptip-关闭", "a": "202062-1" },
                        { "k": "p11028", "v": "订单确认页-apptip-logo", "a": "202062-2" },
                        { "k": "p11029", "v": "订单确认页-apptip-打开客户端", "a": "202062-3" },

                        { "k": "p11026", "v": "订单确认页-点击登录", "a": "202062-4" },
                        { "k": "p1661", "v": "订单确认页-身份证被退回弹出框-继续使用点击", "a": "202062-5" },
                        { "k": "p1662", "v": "订单确认页-身份证被退回弹出框-修改身份证点击", "a": "202062-6" },
                        { "k": "p1534", "v": "订单确认页-点击支付宝", "a": "202062-7" },
                        { "k": "p1535", "v": "订单确认页-点击微信支付", "a": "202062-8" },
                        { "k": "p1536", "v": "订单确认页-点击货到付款", "a": "202062-9" },
                        { "k": "p1167", "v": "订单确认页-确认点击", "a": "202062-10" },

                        //特殊
                        { "k": "p1495", "v": "订单确认页-点击返回", "a": "202062-span-1" },
                        { "k": "p1166", "v": "订单确认页-收货人信息点击", "a": "202062-div-2" },
                        { "k": "p1166", "v": "订单确认页-收货人信息点击", "a": "202062-div-3" },
                        { "k": "p1253", "v": "订单确认页-点击发票信息", "a": "202062-div-4" },
                        { "k": "p1490", "v": "订单确认-点击优惠券", "a": "202062-div-5" },
                        //{ "k": "p1168", "v": "订单确认页-支付方式点击", "a": "" },
                        //{ "k": "p1821", "v": "订单确认页-下单-订单提交成功", "a": "" },
                        //{ "k": "p1496", "v": "订单确认页-点击返回弹出框-点击取消订单", "a": "" },
                        //{ "k": "p1497", "v": "订单确认页-点击返回弹出框-点击继续买", "a": "" },
            ]
        },
        //物流信息页
        "101051": {
            //物流信息页-操作
            "202074": [
                      { "k": "p1229", "v": "物流信息页-点击返回", "a": "202074-1" },
                      { "k": "p1230", "v": "物流信息页-点击电话", "a": "202074-2" },
                      { "k": "p1589", "v": "物流信息页-包裹点击（总）", "a": "202074-3" },
            ]
        },
        //管理地址页
        "101052": {
            //管理收货地址页-操作
            "202042": [
                     { "k": "p1238", "v": "管理收货地址页-点击返回", "a": "202042-1" },
                     { "k": "p1232", "v": "管理收货地址页-点击添加新地址", "a": "202042-2" },
                     { "k": "p1236", "v": "管理收货地址页-删除收货地址弹出框-点击取消", "a": "202042-3" },
                     { "k": "p1237", "v": "管理收货地址页-删除收货地址弹出框-点击确定", "a": "202042-4" },
            ],
            //管理收货地址页-列表
            "202043": [
                     { "k": "p1235", "v": "管理收货地址页-地址删除", "a": "202043-1" },
                     { "k": "p1233", "v": "管理收货地址页-点击编辑地址", "a": "202043-2" },
            ]
        },
        //新增收货地址
        "101053": {
            //新增收货地址页-操作
            "202041": [
                     { "k": "p1240", "v": "新增收货地址页-点击返回", "a": "202041-1" },
                     { "k": "p1239", "v": "新增收货地址页-点击保存", "a": "202041-2" },
            ]
        },
        //修改默认收货地址页
        "101054": {
            //修改收货地址页-操作
            "202041": [
                    { "k": "p1245", "v": "修改默认收货地址页-点击返回", "a": "202041-1" },
                    { "k": "p1243", "v": "修改默认收货地址页-点击保存", "a": "202041-2" },
                    { "k": "p1241", "v": "修改收货地址页-点击删除收货地址", "a": "202041-div-1" },
                    //{ "k": "p1242", "v": "修改收货地址页-点击设为默认收货地址", "a": "" },
            ]
        },
        //发票信息页
        "101056": {
            //发票信息页-操作
            "202060": [
                         { "k": "p11030", "v": "发票信息页-点击返回", "a": "202060-1" },
                         { "k": "p1256", "v": "发票信息页-点击保存", "a": "202060-2" },
                         { "k": "p1254", "v": "发票信息页-点击不开发票", "a": "202060-3" },
                         { "k": "p1255", "v": "发票信息页-点击普通发票", "a": "202060-4" },
                         { "k": "p1259", "v": "发票信息页-点击个人", "a": "202060-5" },
                         { "k": "p1260", "v": "发票信息页-点击公司", "a": "202060-6" },
                         //特殊
                         { "k": "p1261", "v": "发票信息页-点击发票内容选择框", "a": "202060-select-1" },
                         { "k": "p1262", "v": "发票信息页-点击发票内容", "a": "202060-option" },

                         //{ "k": "p1257", "v": "发票信息页-放弃填写弹出框-点击放弃", "a": "" },
                         //{ "k": "p1258", "v": "发票信息页-放弃填写弹出框-点击继续填写", "a": "" },
            ]
        },
        //月销TOP页
        "101057": {
            //月销TOP页-操作
            "202075": [
                    { "k": "p11031", "v": "月销TOP-点击返回", "a": "202075-1" },
                    { "k": "p11032", "v": "月销TOP-点击返回头部", "a": "202075-3" },
            ],
            //月销TOP页-商品列表
            "202076": [
                   //特殊
                    { "k": "p1469", "v": "月销TOP-点击商品", "a": "202076-div" },
            ]
        },
        //限时抢购
        "101058": {
            //限时抢购页-商品
            "202050": [
                     //特殊
                     { "k": "p1473", "v": "限时抢购-点击商品", "a": "202050-div" },
            ],
            //限时抢购页-时间选择
            "202051": [
                     { "k": "p1473", "v": "限时抢购-点击时间", "a": "202051" },
            ]
        },
        //品牌特惠列表页
        "101059": {
            //品牌特惠列表页-操作
            "202082": [
                      { "k": "p11033", "v": "品牌特惠列表页-点击返回", "a": "202082-1" },
            ],
            //品牌特惠列表页-品牌专题
            "202052": [
                     { "k": "p1474", "v": "品牌特惠列表页-点击品牌专题", "a": "202052" },
            ]
        },
        //品牌特惠详情页
        "101062": {
            //品牌特惠详情页-操作
            "202083": [
               { "k": "p11034", "v": "品牌特惠详情页-点击返回", "a": "202083-1" },
               { "k": "p11035", "v": "品牌特惠详情页-apptip-关闭", "a": "202083-3" },
               { "k": "p11036", "v": "品牌特惠详情页-apptip-logo", "a": "202083-4" },
               { "k": "p11037", "v": "品牌特惠详情页-apptip-打开客户端", "a": "202083-5" },
            ],
            //品牌特惠详情页-商品
            "202053": [
            //特殊
           { "k": "p1476", "v": "品牌特惠详情页-点击商品", "a": "202053-div" },
            ]
        },
        //进口货页
        "101061": {
            //进口货页-操作
            "202084": [
                      { "k": "p11038", "v": "进口货页-点击返回", "a": "202084-1" },
            ],
            //进口货页-商品列表
            "202077": [
                      { "k": "p1479", "v": "进口货-点击商品", "a": "202077" },
            ]
        },
        //我的账户
        "101063": {
            //我的账户-菜单
            "202038": [
                      { "k": "p11039", "v": "我的账户-返回按钮", "a": "202038-1" },
                      { "k": "p1483", "v": "我的账户-点击管理收货地址", "a": "202038-2" },
                      { "k": "p1484", "v": "我的账户-点击修改密码", "a": "202038-3" },
            ]
        },
        //我的优惠劵
        "101064": {
            //我的优惠劵-操作
            "202054": [
                        { "k": "p11040", "v": "我的优惠券-点击返回", "a": "202054-1" },
                        { "k": "p1488", "v": "我的优惠券-点击兑换优惠券", "a": "202054-2" },
                        //特殊
                        { "k": "p1485", "v": "我的优惠劵-点击未使用", "a": "202054-li-1" },
                        { "k": "p1486", "v": "我的优惠劵-点击历史", "a": "202054-li-2" },
            ],
            //我的优惠劵-说明
            "202055": [
                       { "k": "p1527", "v": "我的优惠劵-点击使用范围说明按钮展开", "a": "202055" },
                       { "k": "p1528", "v": "我的优惠劵-点击使用范围说明按钮收起", "a": "202055" },
            ]
        },
        //使用优惠劵
        "101065": {
            //使用优惠劵-操作
            "202059": [
                            { "k": "p11041", "v": "使用优惠劵-点击返回", "a": "202059-1" },
                            { "k": "p1494", "v": "使用优惠劵-点击使用说明", "a": "202059-2" },
                            { "k": "p1491", "v": "使用优惠劵-点击兑换", "a": "202059-3" },
                            { "k": "p1492", "v": "使用优惠劵-使用一个优惠券-点击确定", "a": "202059-4" },
                           //{ "k": "p1493", "v": "使用优惠劵-取消使用优惠券-点击确定", "a": "" },
                           //{ "k": "p1529", "v": "使用优惠劵-点击使用范围说明按钮展开", "a": "" },
                           //{ "k": "p1530", "v": "使用优惠劵-点击使用范围说明按钮收起", "a": "" },
            ]
        },
        //兑换优惠券
        "101066": {
            //兑换优惠券-操作
            "202056": [
                        { "k": "p11042", "v": "兑换优惠券-点击返回", "a": "202056-1" },
                        { "k": "p1489", "v": "兑换优惠券-点击兑换", "a": "202056-2" },
            ]
        },
        //使用说明
        "101067": {
            //使用说明-操作
            "202061": [
                    { "k": "p11043", "v": "使用说明-返回", "a": "202061-1" },
            ]
        },
        //我的收藏
        "101068": {
            //我的收藏-操作
            "202057": [
      { "k": "p11044", "v": "我的收藏-点击返回", "a": "202057-1" },
      { "k": "p1509", "v": "我的收藏-编辑点击", "a": "202057-2" },
      { "k": "p1511", "v": "我的收藏-编辑-点击完成", "a": "202057-3" },
      { "k": "p1510", "v": "我的收藏-编辑-删除点击", "a": "202057-4" },
      { "k": "p1514", "v": "我的收藏-点击去逛逛", "a": "202057-5" },
                                 //{ "k": "p1512", "v": "我的收藏-编辑-点击选中商品", "a": "" },
                                 //{ "k": "p1513", "v": "我的收藏-编辑-点击取消选中商品", "a": "" },
            ],
            //我的收藏-商品
            "202058": [
                               //特殊
                     { "k": "p1508", "v": "我的收藏-商品点击", "a": "202058-li" },
            ]
        },
        //意见反馈
        "101069": {
            //意见反馈-操作
            "202068": [
                        { "k": "p11045", "v": "意见反馈-点击返回", "a": "202068-1" },
                        { "k": "p1516", "v": "意见反馈-点击提交", "a": "202068-2" },
            ]
        },
        //帮助与意见反馈
        "101034": {
            //帮助与意见反馈-操作
            "202094": [
                       { "k": "p11081", "v": "帮助与意见反馈-点击返回", "a": "202094-1" },
                       { "k": "p11082", "v": "帮助与意见反馈-点击意见反馈", "a": "202094-2" },
            ]
        },
        //选择支付方式
        "101081": {
            //选择支付方式-操作
            "202066": [
      { "k": "p11046", "v": "选择支付方式-点击返回", "a": "202066-1" },
      { "k": "p1541", "v": "选择支付方式-立即支付点击", "a": "202066-2" },
      { "k": "p11047", "v": "选择支付方式-正在申请支付", "a": "202066-3" },
            ],
            //选择支付方式-方式
            "202067": [
     { "k": "p1538", "v": "选择支付方式-支付宝点击", "a": "202067-1" },
     { "k": "p1539", "v": "选择支付方式-微信支付点击", "a": "202067-2" },
     { "k": "p1540", "v": "选择支付方式-货到付款点击", "a": "202067-3" },
            ]
        },
        //支付成功
        "101089": {
            //支付成功-操作
            "202063": [
      { "k": "p11048", "v": "支付成功页-点击返回", "a": "202063-span-1" },
      { "k": "p1607", "v": "支付成功页-查看订单点击", "a": "202063-1" },
      { "k": "p11049", "v": "支付成功页-填写推荐人", "a": "202063-2" },
      { "k": "p11050", "v": "支付成功页-设置密码保存", "a": "202063-3" },

      { "k": "p11051", "v": "支付成功-apptip-关闭", "a": "202063-4" },
      { "k": "p11052", "v": "支付成功-apptip-logo", "a": "202063-5" },
      { "k": "p11053", "v": "支付成功-apptip-打开客户端", "a": "202063-6" },
            ],
            //支付成功-推荐
            "202064": [
                                 //特殊
     { "k": "p1725", "v": "支付成功页 - 相关推荐 - 点击商品位置1", "a": "202064-div-1" },
     { "k": "p1726", "v": "支付成功页 - 相关推荐 - 点击商品位置2", "a": "202064-div-2" },
     { "k": "p1727", "v": "支付成功页 - 相关推荐 - 点击商品位置3", "a": "202064-div-3" },
     { "k": "p1728", "v": "支付成功页 - 相关推荐 - 点击商品位置4", "a": "202064-div-4" },
     { "k": "p1729", "v": "支付成功页 - 相关推荐 - 点击商品位置5", "a": "202064-div-5" },
     { "k": "p1730", "v": "支付成功页 - 相关推荐 - 点击商品位置6", "a": "202064-div-6" },
     { "k": "p1731", "v": "支付成功页 - 相关推荐 - 点击商品位置7", "a": "202064-div-7" },
     { "k": "p1732", "v": "支付成功页 - 相关推荐 - 点击商品位置8", "a": "202064-div-8" },
     { "k": "p1733", "v": "支付成功页 - 相关推荐 - 点击商品位置9", "a": "202064-div-9" },
     { "k": "p1734", "v": "支付成功页 - 相关推荐 - 点击商品位置10", "a": "202064-div-10" },
     { "k": "p1735", "v": "支付成功页 - 相关推荐 - 点击商品位置11", "a": "202064-div-11" },
     { "k": "p1736", "v": "支付成功页 - 相关推荐 - 点击商品位置12", "a": "202064-div-12" },
     { "k": "p1737", "v": "支付成功页 - 相关推荐 - 点击商品位置13", "a": "202064-div-13" },
     { "k": "p1738", "v": "支付成功页 - 相关推荐 - 点击商品位置14", "a": "202064-div-14" },
     { "k": "p1739", "v": "支付成功页 - 相关推荐 - 点击商品位置15", "a": "202064-div-15" },
     { "k": "p1740", "v": "支付成功页 - 相关推荐 - 点击商品位置16", "a": "202064-div-16" },
     { "k": "p1741", "v": "支付成功页 - 相关推荐 - 点击商品位置17", "a": "202064-div-17" },
     { "k": "p1742", "v": "支付成功页 - 相关推荐 - 点击商品位置18", "a": "202064-div-18" },
     { "k": "p1743", "v": "支付成功页 - 相关推荐 - 点击商品位置19", "a": "202064-div-19" },
     { "k": "p1744", "v": "支付成功页 - 相关推荐 - 点击商品位置20", "a": "202064-div-20" },
            ]
        },
        //支付失败
        "101090": {
            //支付失败-操作
            "202065": [
                            //特殊
 { "k": "p11054", "v": "支付失败页-点击返回", "a": "202065-span-1" },

 { "k": "p11055", "v": "支付失败页-点击更改支付方式", "a": "202065-1" },
 { "k": "p11056", "v": "支付失败页-点击填写推荐人", "a": "202065-2" },
            ]
        },
        //新品推荐页
        "101060": {
            //新品推荐页-操作
            "202097": [
              { "k": "p11106", "v": "新品推荐页-点击返回", "a": "202097-1" },
              { "k": "p11107", "v": "新品推荐页-点击返回顶部", "a": "202097-2" },
            ],
            //新品推荐页-商品
            "202098": [
                  { "k": "p1477", "v": "新品推荐页-点击商品", "a": "202098" },
            ]
        },
        //新增
        //搜索页
        "102001": {
            //头部
            "202030": [
            { "k": "p11057", "v": "搜索页-返回", "a": "202030-1" },
            { "k": "p11058", "v": "搜索页-点击搜索按钮", "a": "202030-2" },
            ],
            //搜索页-联想词
            "202031": [
                               //特殊p
         { "k": "p1219", "v": "搜索-点击联想词", "a": "202031-p" },
            ],
            //搜索页-热搜
            "202085": [
            { "k": "p1657", "v": "搜索页-热搜关键词点击", "a": "202085" },
            ]
        },
        //特价
        "102002": {
            //特价-操作
            "202078": [
            { "k": "p11059", "v": "特价-点击返回", "a": "202078-1" },
            ],
            //特价-商品列表
            "202079": [
                                     //特殊div
              { "k": "p11060", "v": "特价-点击商品", "a": "202079-div" },
            ]
        },
        //秒杀
        "102003": {
            //秒杀-操作
            "202080": [
      { "k": "p11061", "v": "秒杀-点击返回", "a": "202080-1" },
            ],
            //秒杀-商品列表
            "202081": [
      { "k": "p11062", "v": "秒杀-点击商品", "a": "202081" },
            ]
        },
        //阶梯价秒杀
        "102004": {
            //阶梯价秒杀-操作
            "202086": [
              { "k": "p11063", "v": "阶梯价秒杀-点击返回", "a": "202086-1" },
            ],
            //阶梯价秒杀-商品列表
            "202087": [
           { "k": "p11064", "v": "阶梯价秒杀-点击商品", "a": "202087" },
            ]
        },
        //阶梯数量秒杀
        "102005": {
            //阶梯数量秒杀-操作
            "202088": [
            { "k": "p11065", "v": "阶梯数量秒杀-点击返回", "a": "202088-1" },
            ],
            //阶梯数量秒杀-商品列表
            "202089": [
              { "k": "p11066", "v": "阶梯数量秒杀-点击商品", "a": "202089" },
            ]
        },
        //绑定推荐人页面
        "102006": {
            //绑定推荐人页面-操作
            "202090": [
            { "k": "p11067", "v": "绑定推荐人页面-点击返回", "a": "202090-1" },
            { "k": "p11068", "v": "绑定推荐人页面-点击跳过", "a": "202090-2" },
            { "k": "p11069", "v": "绑定推荐人页面-点击确定", "a": "202090-3" },
            ]
        },
        //充值中心
        "102007": {
            //充值中心-操作
            "202091": [
   { "k": "p11070", "v": "充值中心-点击返回", "a": "202091-1" },
   { "k": "p11071", "v": "充值中心-点击立即充值", "a": "202091-2" },
   { "k": "p11072", "v": "充值中心-点击正在申请支付", "a": "202091-3" },
                           //特殊
   { "k": "p11073", "v": "充值中心-点击充话费", "a": "202091-li-1" },
   { "k": "p11074", "v": "充值中心-点击充流量", "a": "202091-li-2" },
            ]
        },
        //充值-选择支付方式
        "102008": {
            //充值-选择支付方式-操作
            "202092": [
            { "k": "p11075", "v": "充值-选择支付方式-点击返回", "a": "202092-1" },
            { "k": "p11076", "v": "充值-选择支付方式-立即支付点击", "a": "202092-2" },
            { "k": "p11077", "v": "充值-选择支付方式-正在申请支付", "a": "202092-3" },
            ],
            //充值-选择支付方式-方式
            "202093": [
           { "k": "p11078", "v": "充值-选择支付方式-支付宝点击", "a": "202093-1" },
           { "k": "p11079", "v": "充值-选择支付方式-微信支付点击", "a": "202093-2" },
           { "k": "p11080", "v": "充值-选择支付方式-货到付款点击", "a": "202093-3" },
            ]
        },
        //我的充值订单
        "102010": {
            //我的充值订单-操作
            "202099": [
            { "k": "p11108", "v": "我的充值订单-返回点击", "a": "202099-1" },
            { "k": "p11109", "v": "我的充值订单-待付款点击", "a": "202069-2" },
            { "k": "p11110", "v": "我的充值订单-待充值点击", "a": "202069-3" },
            { "k": "p11111", "v": "我的充值订单-充值成功点击", "a": "202069-4" },
            { "k": "p11112", "v": "我的充值订单-充值失败点击", "a": "202069-5" },
            { "k": "p11113", "v": "我的充值订单-点击返回头部", "a": "202069-6" },
                                      //特殊
            { "k": "p11114", "v": "我的充值订单-全部订单点击", "a": "202069-span-1" },
            ],
            //我的充值订单-订单列表
            "202100": [
            ]
        },
        //搜索-无结果页
        "102009": {
            //搜索-无结果页-操作
            "202095": [
            { "k": "p11083", "v": "搜索-无结果页-点击返回", "a": "202095-1" },
            { "k": "p11084", "v": "搜索-无结果页-点击打开app", "a": "202095-2" },
            { "k": "p11085", "v": "搜索-无结果页-点击领取返现特权", "a": "202095-3" },
            ],
            //搜索-无结果页-推荐
            "202096": [
                                    //特殊
         { "k": "p11086", "v": "搜索-无结果页 - 相关推荐 - 点击商品位置1", "a": "202096-div-1" },
         { "k": "p11087", "v": "搜索-无结果页 - 相关推荐 - 点击商品位置2", "a": "202096-div-2" },
         { "k": "p11088", "v": "搜索-无结果页 - 相关推荐 - 点击商品位置3", "a": "202096-div-3" },
         { "k": "p11089", "v": "搜索-无结果页 - 相关推荐 - 点击商品位置4", "a": "202096-div-4" },
         { "k": "p11090", "v": "搜索-无结果页 - 相关推荐 - 点击商品位置5", "a": "202096-div-5" },
         { "k": "p11091", "v": "搜索-无结果页 - 相关推荐 - 点击商品位置6", "a": "202096-div-6" },
         { "k": "p11092", "v": "搜索-无结果页 - 相关推荐 - 点击商品位置7", "a": "202096-div-7" },
         { "k": "p11093", "v": "搜索-无结果页 - 相关推荐 - 点击商品位置8", "a": "202096-div-8" },
         { "k": "p11094", "v": "搜索-无结果页 - 相关推荐 - 点击商品位置9", "a": "202096-div-9" },
         { "k": "p11095", "v": "搜索-无结果页 - 相关推荐 - 点击商品位置10", "a": "202096-div-10" },
         { "k": "p11096", "v": "搜索-无结果页 - 相关推荐 - 点击商品位置11", "a": "202096-div-11" },
         { "k": "p11097", "v": "搜索-无结果页 - 相关推荐 - 点击商品位置12", "a": "202096-div-12" },
         { "k": "p11098", "v": "搜索-无结果页 - 相关推荐 - 点击商品位置13", "a": "202096-div-13" },
         { "k": "p11099", "v": "搜索-无结果页 - 相关推荐 - 点击商品位置14", "a": "202096-div-14" },
         { "k": "p11100", "v": "搜索-无结果页 - 相关推荐 - 点击商品位置15", "a": "202096-div-15" },
         { "k": "p11101", "v": "搜索-无结果页 - 相关推荐 - 点击商品位置16", "a": "202096-div-16" },
         { "k": "p11102", "v": "搜索-无结果页 - 相关推荐 - 点击商品位置17", "a": "202096-div-17" },
         { "k": "p11103", "v": "搜索-无结果页 - 相关推荐 - 点击商品位置18", "a": "202096-div-18" },
         { "k": "p11104", "v": "搜索-无结果页 - 相关推荐 - 点击商品位置19", "a": "202096-div-19" },
         { "k": "p11105", "v": "搜索-无结果页 - 相关推荐 - 点击商品位置20", "a": "202096-div-20" },
            ]
        },
        //摇电视商品详情页
        "102011": {
            //摇电视商品详情页-操作
            "202103": [
            ]
        },
        //活动页-优惠卷兑换
        "102012": {
            //活动页-优惠卷兑换-操作
            "202104": [
                   { "k": "p11125", "v": "活动页-优惠卷兑换-点击logo", "a": "202104-1" },
                   { "k": "p11126", "v": "活动页-优惠卷兑换-点击获取验证码", "a": "202104-2" },
                   { "k": "p11127", "v": "活动页-优惠卷兑换-点击立即兑换", "a": "202104-3" },
                   { "k": "p11128", "v": "活动页-优惠卷兑换弹出层-点击跳转下载app", "a": "202104-4" },
                    //特殊
                   { "k": "p11129", "v": "活动页-优惠卷兑换-点击图片验证码", "a": "202104-img-1" },
                   { "k": "p11130", "v": "活动页-优惠卷兑换弹出层-点击关闭", "a": "202104-div-2" },
            ]
        },
        //活动页-FullCut
        "102013": {
            //活动页-FullCut-操作
            "202105": [
                   { "k": "p11131", "v": "活动页-FullCut-点击返回", "a": "202105-1" },
                   { "k": "p11132", "v": "活动页-FullCut-点击图标", "a": "202105-2" },
                   { "k": "p11135", "v": "活动页-FullCut-点击去逛逛", "a": "202105-5" },

                    //特殊
                   { "k": "p11133", "v": "活动页-FullCut-点击默认", "a": "202105-li-1" },
                   { "k": "p11134", "v": "活动页-FullCut-点击销量", "a": "202105-li-2" },
            ],
            //活动页-FullCut-商品
            "202106": [
                   { "k": "p11136", "v": "活动页-FullCut-点击商品", "a": "202106-li" },
            ]
        },
    };
    //除a标签以外的部分页面部分模块下面的特殊标签添加埋点
    map.special = {
        //注册页
        "101003": {
            "202032": [
     { taget: "button", style: "d_get_code", name: "", id: "btnCode" },
     { taget: "span", style: "cdc0f50", name: "", id: "span_xy" },
     { taget: "img", style: "d_get_code", name: "", id: "Verify_codeImag" }
            ]
        },
        //短信登录页
        "101004": {
            "202034": [
               { taget: "button", style: "d_get_code", name: "", id: "btnCode" },
               { taget: "span", style: "cdc0f50", name: "", id: "span_xy" },
               { taget: "img", style: "d_get_code", name: "", id: "Verify_codeImag" }
            ]
        },
        //设置密码页
        "101005": {
            "202035": [
           { taget: "button", style: "", name: "", id: "btnCode" },
           { taget: "img", style: "", name: "", id: "Verify_codeImag" }
            ]
        },
        //TV直播
        "101009": {
            "202029": [
                { taget: "div", style: "pinp - sg", name: "", id: "" }
            ]
        },
        //商品详情页
        "101012": {
            "202044": [
               { taget: "div", style: "lid", name: "", id: "" },
               { taget: "span", style: "", name: "", id: "maintelbuy" },
               { taget: "span", style: "fl jt", name: "", id: "" },
               { taget: "li", style: "", name: "", id: "" },
            ]
        },
        //登录页
        "101013": {
            "202033": [
               { taget: "span", style: "fl d_mgt12", name: "", id: "btnPhoneReg" },
               { taget: "span", style: "fr d_mgt12", name: "", id: "btnForget" }
            ]
        },
        //我的订单列表页
        "101043": {
            "202069": [
               { taget: "span", style: "", name: "", id: "sel_all_num" },
            ]
        },
        //订单确认页
        "101047": {
            "202062": [
               { taget: "span", style: "", name: "", id: "btnBack" },
               { taget: "div", style: "", name: "", id: "divAddressLogin" },
               { taget: "div", style: "", name: "", id: "divAddressUnLogin" },
               { taget: "div", style: "", name: "", id: "divfp" },
               { taget: "div", style: "", name: "", id: "divyhq" },
            ]
        },
        //发票信息页
        "101056": {
            "202060": [
               { taget: "select", style: "", name: "", id: "fpnrtype" },
               { taget: "option", style: "", name: "", id: "" },
            ]
        },
        //月销TOP页
        "101057": {
            "202076": [
               { taget: "div", style: "phli", name: "", id: "" },
            ]
        },
        //限时抢购页
        "101058": {
            "202050": [
               { taget: "div", style: "lid", name: "", id: "" },
            ]
        },
        //品牌特惠详情页
        "101062": {
            "202053": [
               { taget: "div", style: "lid", name: "", id: "" },
            ]
        },
        //我的优惠劵
        "101064": {
            "202054": [
               { taget: "li", style: "", name: "", id: "li_weishiyong" },
               { taget: "li", style: "", name: "", id: "li_lishi" },
            ]
        },
        //我的收藏
        "101068": {
            "202058": [
               { taget: "li", style: "", name: "", id: "" },
            ]
        },
        //支付成功页
        "101089": {
            "202063": [
                    { taget: "span", style: "", name: "", id: "btnBack" },
            ],
            "202064": [
                    { taget: "div", style: "lid", name: "", id: "" },
            ]
        },
        //支付失败页
        "101090": {
            "202065": [
               { taget: "span", style: "", name: "", id: "btnBack" },
            ]
        },
        //搜索页
        "102001": {
            "202031": [
               { taget: "p", style: "", name: "", id: "" },
            ]
        },
        //特价
        "102002": {
            "202079": [
               { taget: "div", style: "fl", name: "", id: "" },
            ]
        },
        //充值中心
        "102007": {
            "202091": [
               { taget: "li", style: "", name: "", id: "cz1" },
               { taget: "li", style: "", name: "", id: "cz2" },
            ]
        },
        //搜索-无结果
        "102009": {
            "202096": [
               { taget: "div", style: "lid", name: "", id: "" },
            ]
        },
        //我的充值订单
        "102010": {
            "202099": [
               { taget: "span", style: "", name: "", id: "sel_all_num" },
            ]
        },
        //活动页-优惠卷兑换
        "102012": {
            "202104": [
               { taget: "img", style: "", name: "", id: "Verify_codeImag" },
               { taget: "div", style: "", name: "", id: "btnclose" },
            ]
        },
        //活动页-FullCut
        "102013": {
            "202105": [
               { taget: "li", style: "", name: "", id: "" },
            ],
            "202106": [
            { taget: "li", style: "", name: "", id: "" },
            ]
        },
    };
    //动态模块
    map.dynamicModule = {
        "101006": {
            "column-left clearfix": "202006",
            "column-right clearfix": "202007"
        },
    };
    el.elements = [];
    el.specialElements = [];
    //初始化页面埋点标签序号
    el.initElement = function () {

        el.dynamicModuleInit();

        var arr = w.document.getElementsByTagName("a");
        el.elements = arr;
        var length = el.elements.length;
        var groups = [];
        var modules = map.mapping[op.page];

        var group = [];
        for (var k in modules) {
            var data = { module: k, arr: [] };
            for (var i = 0; i < length; i++) {
                var element = el.elements[i];
                el.isSuc = false;
                el.math(k, element);
                if (el.isSuc) {
                    data.arr.push(element);
                }
            }
            group.push(data);
        }
        var gl = group.length;
        for (var k = 0; k < gl; k++) {
            var mk = group[k].module;
            var arr = group[k].arr;
            var al = arr.length;
            for (var i = 0; i < al; i++) {
                var element = arr[i];
                element.setAttribute("num", mk + "-" + (i + 1));
            }
        }
        //特殊标签
        var specials = map.special[op.page];
        var selarr = [];
        var setarr = [];
        for (var k in specials) {
            var elements = specials[k];
            if (isArray(elements)) {
                var l = 0;
                for (var i = 0; i < elements.length; i++) {
                    var ele = elements[i];
                    var eles = [];
                    setarr = [];
                    if (ele.id != "") {
                        var e = w.document.getElementById(ele.id);
                        e.setAttribute("num", k + "-" + ele.taget + "-" + (i + 1));
                        selarr.push(e);
                    }
                    if (ele.id == "" && ele.style != "") {
                        eles = w.document.getElementsByClassName(ele.style);
                    }
                    if (ele.id == "" && ele.style == "") {
                        eles = w.document.getElementsByTagName(ele.taget);
                    }
                    for (var j = 0; j < eles.length; j++) {
                        var e = eles[j];
                        el.isSuc = false;
                        el.math(k, e);
                        if (el.isSuc) {
                            setarr.push(e);
                            selarr.push(e);
                        }
                    }
                    l = setarr.length;
                    for (var j = 0; j < l; j++) {
                        var e = setarr[j];
                        e.setAttribute("num", k + "-" + e.tagName.toLowerCase() + "-" + (j + 1));
                    }
                }
            }
        }
        el.specialElements = selarr;
    };
    //动态分配特殊模块id
    el.dynamicModuleInit = function () {
        //首页 左右两栏
        if (op.page == "101006") {
            var modules = map.dynamicModule[op.page];
            for (var k in modules) {
                var eles = w.document.getElementsByClassName(k);
                var lenght = eles.length;
                for (var i = 0; i < lenght; i++) {
                    var e = eles[i];
                    el.setdynamicModule(modules[k], e);
                }
            }
        }
    };

    el.dealSpecialElement = function (num, element) {
        //特别标签处理
        //处理收藏
        if (num == "202044-7") {
            if (element.getAttribute("class") == "ch01") {
                return "202044-a-2";
            }
            else {
                return "202044-a-1";
            }
        }
        //查询列表页-价格
        if (num == "202025-3") {
            var style = element.parentNode.getAttribute("class");
            if (style == "curr" || style == "") {
                return "202025-a-1";
            }
            else {
                return "202025-a-2";
            }
        }
        return num;
    };
    //初始化标签事件
    el.initEvent = function (arr) {
        var length = arr.length;
        for (var i = 0; i < length; i++) {
            var element = arr[i];
            el.addListener(element, "click", function (e) {

                var obj = e.currentTarget || e.target || e.srcElement;
                var n = obj.tagName.toLowerCase();
                var m = map.get(obj);
                if (m) {
                    //用户点击数据处理
                    var current = db.get(db.type.current);
                    var page = db.get(db.type.page);

                    db.current.fromparent = current.currentpage;
                    db.current.customevent = m.k;
                    db.current.currenttime = new Date().getTime();
                    db.current.savetype = "sendEnd";
                    db.current.fromevent = current.customevent;
                    db.current.frompage = page.parentpage;

                    db.set(db.type.current, db.current);
                    db.add(db.current);

                    db.submit();
                }
            });
        }
    };
    //匹配成功标识
    el.isSuc = false;
    //匹配标签ele是否属于module模块
    el.math = function (mk, ele) {
        var parent = ele.parentNode;
        var n = parent.tagName.toLowerCase();
        if (n == "body") {
            return false;
        }
        var moduleId = parent.getAttribute("module");
        if (moduleId) {
            if (mk == moduleId) {
                el.isSuc = true;
            }
        }
        else {
            el.math(mk, parent);
        }
    };
    el.setdynamicModule = function (mk, ele) {
        var parent = ele.parentNode;
        var n = parent.tagName.toLowerCase();
        if (n == "body") {
            return false;
        }
        var moduleId = parent.getAttribute("module");
        if (moduleId) {
            parent.setAttribute("module", mk);
        }
        else {
            el.mathGetModule(mk, parent);
        }
    };
    el.contain = function (n) {
        for (var i in el.types) {
            if (el.types[i] == n) {
                return 1;
            }
        }
        return 0;
    };
    //添加监听事件
    el.addListener = function (element, type, listener, useCapture) {
        if (element.addEventListener) {
            element.addEventListener(type, listener, !!useCapture);
        } else {
            element.attachEvent && element.attachEvent("on" + type, listener);
        }
    };

    //数据存储
    db = {};
    //类型
    db.type = {
        "original": "original",
        "copy": "copy",
        "current": "current",
        "page": "page"
    };
    //当前数据
    db.current = {
        "29": "customevent",
        "fromparent": "",
        "customevent": "",
        "currenttime": "",
        "savetype": "sendEnd",
        "fromevent": "",
        "frompage": "",
    };
    db.page = {
        "currentpage": "",
        "parentpage": ""
    };
    //添加
    db.add = function (data) {
        var arr = db.getArr(db.type.original);
        arr.push(data);
        db.set(db.type.original, arr);
    };
    //设置
    db.set = function (k, v) {
        if (w.localStorage) {
            var va = w.JSON.stringify(v);
            w.localStorage.setItem(k, va);
        }
    };
    //获取（Object）
    db.get = function (t) {
        var q = {};
        if (w.localStorage) {
            var a = w.localStorage.getItem(t);
            if (a) {
                q = w.JSON.parse(a);
            }
        }
        return q;
    };
    //获取（Array）
    db.getArr = function (t) {
        var q = [];
        if (w.localStorage) {
            var a = w.localStorage.getItem(db.type[t]);
            if (a) {
                q = w.JSON.parse(a);
            }
        }
        return q;
    };
    //复制
    db.copy = function () {
        var source = db.getArr(db.type.original);
        var copy = db.getArr(db.type.copy);
        copy = arrExtend(copy, source);
        db.set(db.type.copy, copy);
        db.remove(db.type.original);

    };
    //删除
    db.remove = function (t) {
        if (w.localStorage) {
            w.localStorage.removeItem(t);
        }
    };
    //源数据条数
    db.count = function () {
        var arr = db.getArr(db.type.original);
        if (arr) {
            return arr.length;
        }
        return 0;
    };
    //ajax
    db.ajax = function (conf) {
        var r = window.XMLHttpRequest ? new XMLHttpRequest() : new ActiveXObject("microsoft.xmlhttp");
        if (!conf.type) {
            conf.type = "get";
        }
        if (!conf.async) {
            conf.async = true;
        }
        if (!conf.dataType) {
            conf.dataType = "text";
        }
        if (!conf.data) {
            conf.data = null;
        }
        if (!conf.timeout) {
            conf.timeout = 5;
            var timmer = w.setTimeout(function () {
                r.abort();
                db.copy();
            }, conf.timeout * 1000);
        }
        try {
            r.open(conf.type, conf.url, conf.async);
            if (conf.type.toLowerCase() == "post") {
                r.setRequestHeader("content-type",
                            "application/x-www-form-urlencoded");
            }
            r.send(conf.data);
            r.onreadystatechange = function () {
                if (r.readyState == 4 && r.status == 200) {
                    if (timmer) {
                        clearTimeout(timmer);
                    }
                    if (conf.dataType.toLowerCase() == "text") {
                        if (conf.success && typeof conf.success == "function") {
                            conf.success(JSON.parse(r.responseText));
                        }
                    }
                    if (conf.dataType.toLowerCase() == "json") {
                        if (conf.success && typeof conf.success == "function") {
                            conf.success(JSON.parse(r.responseText));
                        }
                    }
                    else {
                        if (conf.success && typeof conf.success == "function") {
                            conf.success(r.responseText);
                        }
                    }
                }
                else if (r.readyState == 4 && r.status != 200) {
                    r.abort();
                    db.copy();
                }
            };
        }
        catch (ex) {
            r.abort();
            db.copy();
        }
    };
    //伪ajax
    db.fakeAjax = function (conf) {
        var img = new Image();
        img.src = conf.url + "?" + conf.data;
    };
    //提交
    db.submit = function () {
        if (db.count() >= 100) {
            var d = db.getArr(db.type.original);
            var c = db.getArr(db.type.copy);
            c = arrExtend(c, d);
            var dataObj = {
                "37": JSON.stringify(c),
                "36": {
                    "10": "",
                    "2": "",
                    "15": "",
                    "3": "SI2003_wap",
                    "11": "GMT 8",
                    "4": "",
                    "16": "",
                    "5": "",
                    "12": "",
                    "17": "",
                    "6": "wap",
                    "13": "",
                    "7": "",
                    "8": "",
                    "14": "",
                    "1": new Date().getTime(),
                    "9": ""
                }
            }
            var input = {
                "version": "",
                "dataString": JSON.stringify(dataObj)
            };
            db.ajax({
                url: "/Ajax/API.aspx",
                data: "action=gas&api_input=" + JSON.stringify(input) + "&api_target=com_cmall_groupcenter_account_api_ApiTemporaryCount",
                type: "post",
                success: function (msg) {
                    //console.log(msg);
                    if (msg.resultCode == "1") {
                        db.remove(db.type.original);
                        db.remove(db.type.copy);
                    }
                    else {
                        db.copy();
                    }
                }
            });
        }
    };
    //对数据进行初始化
    (db.init = function () {
        var p = db.get(db.type.current);
        if (!p.childId) {
            p = db.current;
            db.set(db.type.current, p);
        }
        var page = db.get(db.type.page);
        var cp = db.page;
        if (!page.currentpage) {
            cp.currentpage = op.page;
            cp.parentpage = "";
        }
        else {
            cp.currentpage = op.page;
            cp.parentpage = page.currentpage;
        }
        db.set(db.type.page, cp);
    })();
    //主程序
    main.init = function () {
        el.initElement();
        el.initEvent(el.elements);
        el.initEvent(el.specialElements);
        w.clearTimeout(timmerMain);
    };
    var timmerMain = w.setTimeout(function () {
        main.init();
    }, 3000);
})();